# settings
data_path           = "./data"
db_path             = data_path + "/westeros.json"
main_session_path   = data_path + "/main"
helper_session_path = data_path + "/helper"
url                 = "https://westeros-frontend.vercel.app/movies/{imdb_id}?user_id={user_id}"
desktop             = -1001841972670
docs_channel        = -1001693241710
admins              = [956473054, 5479189128]
admin_username      = "@ackermard"


# contents
start = "لطفا نام اثر را ارسال کنید..."
new_user = """
سلام {fname} ✨
با استفاده از این ربات میتونید هر فیلم، سریال، انیمیشن و انیمه ای رو جستجو و دانلود کنید، کافیه نام انگلیسی اون اثر رو برام بفرستی.
برای جستجو با اسکرین شات و اطلاعات بیشتر روی /help کلیک کن.
برای مشاهده لیست علاقه مندی روی /list کلیک کنید.
"""
results = "🔘 از طریق منو انتخاب کنید."
your_fav = "🔘 از طریق منو انتخاب کنید."
not_found = "❕ عنوانی یافت نشد."
bookmarks_is_empty = "❕ لیست شما خالی است."

help_message = f"""
🔰 راهنمای استفاده از ربات
❓ **چطور در ربات جستجو کنم؟**
- کافیه نام انگلیسی اثر رو ارسال کنی، ربات جستجو رو انجام میده و نتایج رو بهتون نشون میده.
❓ **جستجو با اسکرین شات چیه؟**
- بعضی موقع ها توی اینستا، توییتر و... ممکنه عکس یا ویدیویی از یک انیمه رو ببینیم و ندونیم اسمش چیه، برای جستجو و دانلود اون انیمه کافیه یه اسکرین شات ازش رو برای ربات بفرستی.
این قابلیت در حال حاظر فقط برای انیمه کار میکنه و هنوز جای بهتر شدن داره!
❓ **چطور به لیست علاقه مندی ها(بوکمارک) دسترسی داشته باشم؟**
- کافیه دستور /list رو ارسال کنی، لیست به نمایش درمیاد.
❓ **نتونستم چیزی کی میخواستم رو پیدا کنم، چکار کنم؟**
- گروه ما زمان زیادی نیست که شروع به کار کرده و ممکنه کلی اثر باشه که در ربات پیدا نشه، برای همین لطفا نام اثر رو برای {admin_username} ارسال کنین، تا به ربات اضافش کنیم.
📍 در آخر، اگر سوال، پیشنهاد یا انتقادی دارید برای من ({admin_username}) ارسال کنید."""

downloading = "📥 در حال دانلود..."
photo_err = "❌ متاسفانه انیمه شناسایی نشد!"
photo_process = "🌐 در حال شناسایی انیمه..."
photo_results = """✅ جستجو برای {title}
🔘 از طریق منو انتخاب کنید."""

commands = [
    "start",
    "help",
    "list",
    "ping",
    "test",
    "replace",
    "backup",
    "append"
]